alfonsomayoral/Embedded-Systems-Based-Mobile-Robot-Using-STM32L-Discovery/Mobile-Robot_STM32L-Discovery.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32l1xx_it.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define tiempo_encendido_zumbador 		500   			// Tiempo para la intermitencia del zumbador = 0,5 segundos

#define tiempo_encendido_sensor     60000   			// Tiempo para empezar el proceso de lectura del sensor de ultrasonidos
															// = 60000 us. Como el TIM2 está configurado a paso por us y el valor
															// máximo de la respuesta del ECHO es 38 ms = 38000 us (si no hay
															// obstáculo), 60000 us vale como intervalo para lanzar de nuevo
															// el proceso de lectura, ya que es mayor que lo que podría ser
															// la respuesta del ECHO + la señal TRIG (10 us) + tiempo del ultrasonido
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */
	//PITIDO INTERMITENTE ZUMBADOR
	char intermitente = 0;
	
	unsigned short tiempo = 500;
		
	//CALCULAR DISTANCIA
	 unsigned int distancia_cm = 0;
	 unsigned int distancia_tiempo = 0;
	 
	 //ECHO
	 unsigned short inicio_ECHO = 0;
	 unsigned short fin_ECHO = 0;
	 
	 //TRIGGER
	 unsigned short inicio_pulso = 0;
	 unsigned short fin_pulso = 0;
	 
	 //DISTINTAS VELOCIDADES
	 unsigned short DC_MAX = 0;
	 unsigned short DC_MED = 0;
	 
	 //DIFERENTE ESTADOS
	 unsigned int girar_derecha=0;
	 unsigned int girar_izquierda=0;
	 unsigned int vuelta_atras=0;
	 
	 //GIROS
	 unsigned short inicio_mov = 0;
	 unsigned short fin_mov = 0;
	 
	 //PARADA
	 unsigned short inicio_parada= 0;
	 unsigned short fin_parada = 0;

	 //INTERRUPCIONES
	uint8_t fin_trigger=0;
	uint8_t cambio_logico=0;
	uint8_t fin=0;

	//MODULO BLUETOOTH
	uint8_t opciones[7] = "       ";//guardamos los numeros que se envian por bluetooth
	uint8_t mensaje_Transmitir[6] = "      ";//enviar saltos de linea y comienzo de linea

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC_Init(void);
static void MX_TS_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);
static void MX_USART1_UART_Init(void);
/* USER CODE BEGIN PFP */
static void calcular_distancia();
static void generar_pulso();
static void recibir_pulso();
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

static void generar_pulso(){
	  GPIOD->BSRR |= (1<<2);
	  inicio_pulso = TIM2->CNT;
	  fin_pulso = inicio_pulso + 20;
	  while(TIM2->CNT < fin_pulso);
	  GPIOD->BSRR |= (1<<(2+16));

}
static void recibir_pulso(){
	  while((TIM2->SR & 0x0002)==0);
	  inicio_ECHO = TIM2->CCR1;
	  TIM2->SR = 0;
	  while((TIM2->SR & 0x0002)==0);
	  fin_ECHO = TIM2->CCR1;
	  TIM2->SR = 0;

}
static void calcular_distancia(){
	  distancia_tiempo = fin_ECHO - inicio_ECHO;
	  distancia_cm = (unsigned int)((distancia_tiempo*343)/20000); //formula
}
// Función de interrupción del TIM3 para crear la intermitencia del zumbador

void TIM3_IRQHandler(void)//TE AÑADIMOS LOS HANDLERS COMO NOS HAS INDICADO PERO POR PROBLEMAS CON EL SENSOR NO HEMOS PODIDO PROBARLAS SOLO EL ZUMBADOR
{
	if ((TIM3->SR & 0x0004)!=0){	//CANAL 2-->SONIDO INTERMITENTE
			if(intermitente){
				intermitente=0;
			}else{
				intermitente=1;
			}
			TIM3->CCR2 += tiempo2;
			}

		if ((TIM3->SR & 0x0002)!=0){//CANAL 1-->GIROS Y PARADAS
			if(fin==0){
				fin=1;
			}
		}
			TIM3->SR = 0x0000;
}


	void TIM2_IRQHandler(void) {
		if ((TIM2->SR & 0x0004)!=0){	//CANAL 2(TOC)-->ENVIAR EL PULSO
					if(fin_trigger==0){
						fin_trigger=1;
					}
				}
				if((TIM2->SR & (1<<1))!=0){//CANAL 1(TIC)-->RECIBIR EL PULSO
						if(cambio_logico==0){
							cambio_logico=1;
						}
				}
				TIM2->SR = 0x0000;
	}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC_Init();
  MX_TS_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_TIM4_Init();
  MX_USART1_UART_Init();
  /* USER CODE BEGIN 2 */
  
  //MODULO BLUETOOTH
  
  //recepción con interrupciones
  HAL_UART_Receive_IT(&huart1, opciones, 1); //implementación de interrupciones a la recepción de la usart1 (modulo bluetooth)

