alfonsomayoral/Embedded-Systems-Based-Mobile-Robot-Using-STM32L-Discovery/Mobile-Robot_STM32L-Discovery.c
//trasmisión sin interrupciones
 unsigned char mensaje_inicial_USART[40] ="Control del robot: 1, 2, 3, 4, 5, 6 o 7";
 HAL_UART_Transmit(&huart1, mensaje_inicial_USART, 40, 10000);
 mensaje_Transmitir[0] = 0x0A;                 // Añado un salto de línea
 HAL_UART_Transmit(&huart1, mensaje_Transmitir, 1, 10000);
 mensaje_Transmitir[0] = 0x0D;                  // Y un comienzo de línea
 HAL_UART_Transmit(&huart1, mensaje_Transmitir, 1, 10000);



  //PONGO PA1 (ZUMBADOR) COMO SALIDA DIGITAL
  	GPIOA->MODER &=~(1 << 3);//COLOCO 0
  	GPIOA->MODER |= (1 << 2); //COLOCO 1
     GPIOA->BSRR = (1<<1);//pongo un 1 en el zumbador que no suene

  //PONGO PD2 (TRIG) COMO SALIDA DIGITAL
    GPIOD->MODER &= ~(1 << 5);//COLOCO 0
    GPIOD->MODER |= (1 << 4); //COLOCO 1

  //PONGO PA5 (ECHO) COMO FUNCION ALTERNATIVA
    GPIOA->MODER|= (1 << 11);//COLOCO 0
    GPIOA->MODER &=~ (1 << 10); //COLOCO 0
    GPIOA->AFR[0]|=(0x01 << (5*4));// AFR para decir que el PA5 es AF1
  //(TIM2)
    GPIOA->AFR[0]&=~(0x0E << (5*4));


  // Selección del reloj interno: CR1, CR2, SMRC
  	TIM3->CR1 = 0x0000;  // ARPE = 0 -> No es PWM, es TOC
  	                         // CEN = 0; Contador apagado
  	TIM3->CR2 = 0x0000;  // Siempre "0" en este curso
  	TIM3->SMCR = 0x0000; // Siempre "0" en este curso

  // Configuración del funcionamiento del contador: PSC, CNT, ARR y CCRx
  	TIM3->PSC = 31999;   // Preescalado = 32000 -> Frecuencia del contador =
  	      // 32000000/32000 = 1000 pasos por segundo
  	TIM3->CNT = 0;       // Inicializo el valor del contador a cero
  	TIM3->ARR = 0xFFFF;  // Valor recomendado = FFFF
  	TIM3->CCR2 = 500 ;   // Registro donde se guarda el valor que marca la
  	      // comparación existosa en TOC.

  // Selección de IRQ o no: DIER
    TIM3->DIER = 0x0002; // Se genera INT al terminar de contar -> CCyIE = 1

  // Modo de salida del contador
  	TIM3->CCMR1 = 0x0000;  // CCyS = 0 (TOC)
  	                           // OCyM = 000 (no hay salida por el pin HW asociado al
  	 // TIM4)
  	                           // OCyPE = 0 (sin precarga)
  	 TIM3->CCER = 0x0000;   // CCyP = 0 (siempre para TOC)
  	                           // CCyE = 0 (desactivada la salida hardware)

  	    // Habilitación de contador y limpieza de flags
  	 TIM3->EGR |= 0x0001;   // UG = 1 -> Se genera evento de actualización
  	 TIM3->SR = 0;          // Limpio los flags del contador
  	 TIM3->CR1 |= 0x0001;   // CEN = 1 -> Arranco el contador

  	    // Habilitación de la interrupción TIM3_IRQ en el NVIC (posición 29).
  	 NVIC->ISER[0] |= (1 << 29);

     // Habilitación de contador y limpieza de flags
     TIM3->EGR |= 0x0001;   // UG = 1 -> Se genera evento de actualización
     TIM3->SR = 0;          // Limpio los flags del contador
     TIM3->CR1 |= 0x0001;   // CEN = 1 -> Arranco el contador

     // Habilitación de la interrupción TIM3_IRQ en el NVIC (posición 29).
     NVIC->ISER[0] |= (1 << 29);

 //-------------------------Configuracion TIMER2 CANAl1----------------------------

     // Selección del reloj interno: CR1, CR2, SMRC

     TIM2->CR1 =0x0000;  // ARPE = 0 -> No es PWM, es TIC
     TIM2->CR2 = 0x0000;  // Siempre "0" en este curso
     TIM2->SMCR = 0x0000; // Siempre "0" en este curso

     // Configuración del funcionamiento del contador: PSC, CNT, ARR y CCRx

     TIM2->PSC = 31;   // Preescalado = 31 micro segundos
     TIM2->CNT = 0;       // Inicializo el valor del contador a cero
     TIM2->ARR = 0xFFFF;  // Valor recomendado = FFFF

     // Selección de IRQ o no: DIER

     TIM2->CCMR1 = 0x0001;  // CCyS = 1 (TIC); OCyM = 000 y OCyPE = 0 (siempre en TIC)
     TIM2->CCER = 0x000B;  //habilitado la captura de ambos flancos

     // Habilitación de contador y limpieza de flags

     TIM2->EGR |= 0x0001;   // UG = 1 -> Se genera evento de actualización
     TIM2->SR = 0;          // Limpio los flags del contador
     TIM2->CR1 |= 0x0001;   // CEN = 1 -> Arranco el contador


     // Configuración ADC
     GPIOA->MODER |= 0x00000300;    // PA4 como analógico
     ADC1->CR2 &= ~(0x00000001);    // ADON = 0 (ADC apagado)
     ADC1->CR1 = 0x00000000;        // RES = 00 (resolución = 12 bits)
                                    // SCAN = 0 (modo scan deshabilitado)
                                    // EOCIE = 0 (deshabilitada la interupción por
    // EOC)

     ADC1->CR2 = 0x00000412;        // EOCS = 1 (activado el bit EOC al acabar cada
    // conversión)
                                    // DELS = 001 (retardo de la conversión hasta
    // que se lea el dato anterior)
                                    // CONT = 1 (conversión continua)
     ADC1->SMPR1 = 0;               // Sin sampling time (4 cycles)
     ADC1->SMPR2 = 0;
     ADC1->SMPR3 = 0;
     ADC1->SQR1 = 0x00000000;       // 1 elemento solo en la secuencia
     ADC1->SQR5 = 0x00000004;       // El elemento es el canal AIN4
     ADC1->CR2 |= 0x00000001;       // ADON = 1 (ADC activado)

     while ((ADC1->SR&0x0040)==0);  // Si ADCONS = 0, o sea no estoy para convertir,

     ADC1->CR2 |= 0x40000000;       // Si ADCONS = 1, arranco la conversion (SWSTART
    // = 1)
	
	unsigned short valor = 0;
	
	
     //------------------------------------------
       // PB8 TIM4-CH4
          GPIOB->MODER|=0x00000001 << (2*8 +1);  // MODER = 10 (AF) para el bit 7 del
       // puerto B
          GPIOB->MODER&=~(1 << (2*8));
          GPIOB->AFR[1]|=(0x02 << (0*4));        // AFR[0] para decir que el PB7 tiene    CAMBIO
          // la AF2 (TIM4)

       // PB9 TIM4-CH3
          GPIOB->MODER|=0x00000001 << (2*9 +1);  // MODER = 10 (AF) para el bit 7 del
        // puerto B
          GPIOB->MODER&=~(1 << (2*9));
          GPIOB->AFR[1]|=(0x02 << (1*4));        // AFR[0] para decir que el PB7 tiene   ??????????????????
                            // la AF2 (TIM4)
         // PA12 como salida (01) -> Motor izquierdo, IN1 para el control del sentido de giro
         GPIOA->MODER &= ~(1 << (12*2 +1));
         GPIOA->MODER |= (1 << (12*2));

