alfonsomayoral/Embedded-Systems-Based-Mobile-Robot-Using-STM32L-Discovery/Mobile-Robot_STM32L-Discovery.c
         // Selección del reloj interno: CR1, CR2, SMRC
         TIM4->CR1 = 0x0080;                    // ARPE = 1 -> Es PWM; CEN = 0;
                // Contador apagado
         TIM4->CR2 = 0x0000;                    // Siempre "0" en este curso
         TIM4->SMCR = 0x0000;                   // Siempre "0" en este curso

         // Configuración del funcionamiento del contador: PSC, CNT, ARR y CCRx
         TIM4->PSC = 3200;      // Preescalado=32000 -> f_contador=32000000/32000 =      CAMBIO
       // 1000 pasos/segundo
         TIM4->CNT = 0;          // Inicializo el valor del contador a cero
         TIM4->ARR = 9;          // Pongo una frecuencia PWM de 100 Hz y sólo cuento
       // 10 pasos
         //TIM4->CCR3 = 0;        // El Duty cycle se pone a 1 inicialmente             CAMBIO
         //TIM4->CCR4 = 0;
         // Selección de IRQ o no: DIER
         TIM4->DIER = 0x0000;   // No se genera INT al terminar de contar -> CCyIE = 0

         // Modo de salida
         TIM4->CCMR2 = 0x6868;  // CCyS = 0   (TOC, PWM)
                        	  // OCyM = 110 (PWM con el primer semiciclo a 1)
                                // OCyPE = 1  (con precarga)
         TIM4->CCER = 0x1100;   // CCyP = 0   (siempre en PWM)
                                // CCyE = 1   (activada la salida hardware)
         // Habilitación de contador y limpieza de flags
         TIM4->EGR |= 0x0001;   // UG = 1 -> Se genera evento de actualización
         TIM4->SR = 0;          // Limpio los flags del contador
         TIM4->CR1 |= 0x0001;   // CEN = 1 -> Arranco el contado
		TIM4->CCR3 = 0;
		TIM4->CCR4 = 0;


  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

	  while (opciones[0]==0);       // Si no he recibido nada, espero
	  switch(opciones[0]){

	  	case 0x31://AUTOMATICO-->RECEPCION DE UN 1

	  		HAL_UART_Transmit(&huart1, (unsigned char*) "Modo Auto", sizeof("Modo Auto"), 10000);

	  			  		mensaje_Transmitir[0] = 0x0A;         // Añado un salto de línea
	  			  		HAL_UART_Transmit(&huart1, mensaje_Transmitir, 1, 10000);

	  			  		mensaje_Transmitir[0] = 0x0D;          // Y un comienzo de línea
	  			  		HAL_UART_Transmit(&huart1, mensaje_Transmitir, 1, 10000);
	  			  		opciones[0]=0;

	  			  	//MEDIMOS VALOR DEL POTENIOMETRO Y AJUSTAMOS DC

	  				  //MEDIMOS VALOR DEL POTENIOMETRO Y AJUSTAMOS DC
	  				  	  valor=ADC1->DR;
	  				  	  if(valor<1024){
	  				  	  		  DC_MAX=5;
	  				  	  		  DC_MED=1;
	  				  	  }
	  				  	  else if(valor<3072 && valor>=1024){
	  				  	  		  DC_MAX=7;
	  				  	  		  DC_MED=3;
	  				  	  }
	  				  	  else{
	  				  	  		  DC_MAX=8;
	  				  	  		  DC_MED=6;
	  				  	  }


	  				  //MEDIMOS DISTANCIA
	  				  	  generar_pulso();
	  				  	  recibir_pulso();
	  				  	  calcular_distancia();

	  				  	  if(distancia_cm >10)
	  				  		{
	  				  //DISTANCIA ENTRE 10 Y 20 CM
	  				  			if(distancia_cm < 20)
	  				  			{
	  				  				if(intermitente){
	  				  					GPIOA->BSRR = (1<<1);
	  				  					GPIOB->BSRR=(1<<6);
	  				  				}else{
	  				  					GPIOA->BSRR = (1<<1)<<16;
	  				  					GPIOB->BSRR=(1<<6)<<16;

	  				  				}
	  				  				TIM4->CCR3 = DC_MED;
	  				  				GPIOA->BSRR = (1<<11)<<16;

	  				  				TIM4->CCR4 = DC_MED;
	  				  				GPIOA->BSRR = (1<<12)<<16;

	  				  			}else{
								//DISTANCIA >20
	  				  		  		GPIOA->BSRR = (1<<1);
	  				  		  		GPIOB->BSRR= (1<<6);

	  				  				TIM4->CCR3 = DC_MAX;
	  				  				GPIOA->BSRR = (1<<11)<<16;

	  				  				TIM4->CCR4 = DC_MAX;
	  				  				GPIOA->BSRR = (1<<12)<<16;
	  				  			}

	  				  		}
	  				  	  else{
	  				  //DISTANCIA <10CM
	  						GPIOA->BSRR=(1<<1)<<16;
	  						GPIOB->BSRR=(1<<6)<<16;

	  				  		TIM4->CCR3 = 0;
	  				  		TIM4->CCR4 = 0;


	  				  		girar_derecha=1;
	  				  	  }
	  				  	  TIM2->CNT=0;

	  				  //GIRAR DERECHA
	  				  	  if(girar_derecha){
	  				  		//PARAMOS MEDIO SEGUNDO

	  				  		inicio_parada=TIM3->CNT;
	  				  		fin_parada= inicio_parada + 500;

	  				  		while(TIM3->CNT < fin_parada);



	  				  		//GIRO 90º A LA DERECHA
	  				  		inicio_mov=TIM3->CNT;
	  				  		fin_mov=inicio_mov+500;

	  				  		while(TIM3->CNT < fin_mov){
	  				  			TIM4->CCR4 = 0;
	  				  			GPIOA->BSRR = (1<<11);
	  				  		}

	  				  		TIM4->CCR4 = 0;
	  				  		GPIOA->BSRR = (1<<11)<<16;

	  				  		//GIRAMOS MEDIO SEGUNDO

	  				  		inicio_parada=TIM3->CNT;
	  				  		fin_parada= inicio_parada + 500;

	  				  		while(TIM3->CNT < fin_parada);


	  				  		girar_derecha = 0;
	  				  //VOLVEMOS A MEDIR LA DISTANCIA
	  				  		TIM2->CNT=0;
	  				  		generar_pulso();
	  				  		recibir_pulso();
	  				  		calcular_distancia();

	  				  		if(distancia_cm<10){
	  				  			girar_izquierda=1;
	  				  			TIM4->CCR4=0;
	  				  			TIM4->CCR3=0;

	  				  		}


	  				  		TIM2->CNT=0;

	  				  //GIRAMOS 180º A LA IZQUIERDA
	  				  		if(girar_izquierda){
	  				  			//PARAMOS MEDIO SEGUNO
	  				  			inicio_parada=TIM3->CNT;
	  				  			fin_parada= inicio_parada + 500;

	  				  			while(TIM3->CNT < fin_parada);

	  				  			inicio_mov=TIM3->CNT;
	  				  			fin_mov=inicio_mov+1000;

	  				  			while(TIM3->CNT < fin_mov){
	  				  				TIM4->CCR3 = 0;
	  				  				GPIOA->BSRR = (1<<12);
	  				  			}

	  				  			TIM4->CCR3=0;
	  				  			GPIOA->BSRR = (1<<12)<<16;

	  				  			inicio_parada=TIM3->CNT;
	  				  			fin_parada= inicio_parada + 500;
	  				  			while(TIM3->CNT < fin_parada);

	  				  			girar_izquierda=0;

	  				  //PROCESO DISTANCIA
	  					  		generar_pulso();
	  					  		recibir_pulso();
	  					  		calcular_distancia();

	  				  			if(distancia_cm<10){
	  				  				vuelta_atras=1;
	  				  				TIM4->CCR4=0;
	  				  				TIM4->CCR3=0;
	  				  			}

	  				  			TIM2->CNT=0;

	  				  //GIRAMOS OTROS 90º A LA IZQUIERDA Y VOLVEMOS POR DONDE VEN�?AMOS
	  				  			if(vuelta_atras){
	  				  				//PARAMOS MEDIO SEGUNDO

	  				  				inicio_parada=TIM3->CNT;
	  				  				fin_parada= inicio_parada + 500;

