alfonsomayoral/Embedded-Systems-Based-Mobile-Robot-Using-STM32L-Discovery/Mobile-Robot_STM32L-Discovery.c
	  				  				while(TIM3->CNT < fin_parada);

	  				  				inicio_mov=TIM3->CNT;
	  				  				fin_mov=inicio_mov+500;

	  				  				while(TIM3->CNT < fin_mov){
	  				  					TIM4->CCR3 = 0;
	  				  					GPIOA->BSRR = (1<<11);
	  				  				}

	  				  				inicio_parada=TIM3->CNT;
	  				  				fin_parada= inicio_parada + 500;

	  				  				while(TIM3->CNT < fin_parada);

	  				  				TIM4->CCR3=0;
	  				  				GPIOA->BSRR = (1<<11)<<16;
	  				  				vuelta_atras=0;

	  				  			}
	  				  	  }
	  				  		break;
	  				  }

	  	case 0x32://ADELANTE-->RECEPCIÓN DE UN 2
	  		HAL_UART_Transmit(&huart1, (unsigned char*) "Modo Adelante", sizeof("Modo Adelante"), 10000);

	  		mensaje_Transmitir[0] = 0x0A;         // Añado un salto de línea
	  		HAL_UART_Transmit(&huart1, mensaje_Transmitir, 1, 10000);

	  		mensaje_Transmitir[0] = 0x0D;          // Y un comienzo de línea
	  		HAL_UART_Transmit(&huart1, mensaje_Transmitir, 1, 10000);

	  		GPIOA->BSRR = (1<<12)<<16;
	  		GPIOA->BSRR = (1<<11)<<16;
			
	  		TIM4->CCR3 = DC_MAX;
	  		TIM4->CCR4 = DC_MAX;
	  		TIM2->CR1 = 0x0000;
	  		TIM3->CR1 = 0x0000;

	  		opciones[0]=0; //esperamos a que se envie otro modo
	  	break;
	  	case 0x33://MARCHA ATRÁS-->RECEPCION DE UN 3
	  		HAL_UART_Transmit(&huart1, (unsigned char*) "Modo Atras", sizeof("Modo Atras"), 10000);

	  		mensaje_Transmitir[0] = 0x0A;         // Añado un salto de línea
	  		HAL_UART_Transmit(&huart1, mensaje_Transmitir, 1, 10000);

	  		mensaje_Transmitir[0] = 0x0D;          // Y un comienzo de línea
	  		HAL_UART_Transmit(&huart1, mensaje_Transmitir, 1, 10000);

	  		GPIOA->BSRR = (1<<12);
	  		TIM4->CCR3 = 0;
	  		TIM4->CCR4 = 0;
	  		GPIOA->BSRR = (1<<11);
			
	  		TIM2->CR1 = 0x0000;
	  		TIM3->CR1 = 0x0000;

	  		opciones[0]=0;
	  	break;
	  	case 0x34://DERECHA--> RECEPCION DE UN 4
	  		HAL_UART_Transmit(&huart1, (unsigned char*) "Modo Giro Derecha", sizeof("Modo Giro Derecha"), 10000);

	  		mensaje_Transmitir[0] = 0x0A;         // Añado un salto de línea
	  		HAL_UART_Transmit(&huart1, mensaje_Transmitir, 1, 10000);

	  		mensaje_Transmitir[0] = 0x0D;          // Y un comienzo de línea
	  		HAL_UART_Transmit(&huart1, mensaje_Transmitir, 1, 10000);
	  		GPIOA->BSRR = (1<<12)<<16;
	  		TIM4->CCR3 = DC_MED;
	  		TIM4->CCR4 = 0;
	  		GPIOA->BSRR = (1<<11)<<16;
	  		TIM2->CR1 = 0x0000;
	  		TIM3->CR1 = 0x0000;

	  		opciones[0]=0;
	  	break;
	  	case 0x35://IZQUIERDA-->RECIBO UN 5
	  		HAL_UART_Transmit(&huart1, (unsigned char*) "Modo Giro Izq", sizeof("Modo Giro Izq"), 10000);

	  		mensaje_Transmitir[0] = 0x0A;         // Añado un salto de línea
	  		HAL_UART_Transmit(&huart1, mensaje_Transmitir, 1, 10000);

	  		mensaje_Transmitir[0] = 0x0D;          // Y un comienzo de línea
	  		HAL_UART_Transmit(&huart1, mensaje_Transmitir, 1, 10000);
			
	  		GPIOA->BSRR = (1<<12)<<16;
	  		TIM4->CCR3 = 0;
	  		TIM4->CCR4 = DC_MED;
	  		GPIOA->BSRR = (1<<11)<<16;
			
	  		opciones[0]=0;
	  	break;
	  	case 0x36://PARAR-->RECIBO UN 6
	  		HAL_UART_Transmit(&huart1, (unsigned char*) "Modo Parar", sizeof("Modo Parar"), 10000);

	  		mensaje_Transmitir[0] = 0x0A;         // Añado un salto de línea
	  		HAL_UART_Transmit(&huart1, mensaje_Transmitir, 1, 10000);

	  			  		mensaje_Transmitir[0] = 0x0D;          // Y un comienzo de línea
	  			  		HAL_UART_Transmit(&huart1, mensaje_Transmitir, 1, 10000);

	  			  		GPIOA->BSRR = (1<<12)<<16;
	  			  		TIM4->CCR3 = 0;
	  			  		TIM4->CCR4 = 0;
	  			  		GPIOA->BSRR = (1<<11)<<16;
	  			  		TIM2->CR1 = 0x0000;
	  			  		TIM3->CR1 = 0x0000;


	  			  		opciones[0]=0;

	  			  	break;


	     }

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL6;
  RCC_OscInitStruct.PLL.PLLDIV = RCC_PLL_DIV3;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC_Init(void)
{

  /* USER CODE BEGIN ADC_Init 0 */

  /* USER CODE END ADC_Init 0 */

  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC_Init 1 */

  /* USER CODE END ADC_Init 1 */

  /** Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion)
  */
  hadc.Instance = ADC1;
  hadc.Init.ClockPrescaler = ADC_CLOCK_ASYNC_DIV1;
  hadc.Init.Resolution = ADC_RESOLUTION_12B;
  hadc.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc.Init.ScanConvMode = ADC_SCAN_DISABLE;
  hadc.Init.EOCSelection = ADC_EOC_SEQ_CONV;
  hadc.Init.LowPowerAutoWait = ADC_AUTOWAIT_DISABLE;
  hadc.Init.LowPowerAutoPowerOff = ADC_AUTOPOWEROFF_DISABLE;
  hadc.Init.ChannelsBank = ADC_CHANNELS_BANK_A;
  hadc.Init.ContinuousConvMode = DISABLE;
  hadc.Init.NbrOfConversion = 1;
  hadc.Init.DiscontinuousConvMode = DISABLE;
  hadc.Init.ExternalTrigConv = ADC_EXTERNALTRIGCONV_T2_CC3;
  hadc.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
  hadc.Init.DMAContinuousRequests = DISABLE;
  if (HAL_ADC_Init(&hadc) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
  */
  sConfig.Channel = ADC_CHANNEL_4;
  sConfig.Rank = ADC_REGULAR_RANK_1;
  sConfig.SamplingTime = ADC_SAMPLETIME_4CYCLES;
  if (HAL_ADC_ConfigChannel(&hadc, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN ADC_Init 2 */

  /* USER CODE END ADC_Init 2 */

